crypto util
